wegam/STM32F10xUSBF/FWLIB/Lib/Protocol/USART_ISP - 副本.C
/******************************** User_library *********************************
* 文件名 	: SPI_FLASH.C
* 作者   	: wegam@sina.com
* 版本   	: V
* 日期   	: 2017/04/16
* 说明   	: 
********************************************************************************
SPI_FLASH使用功能测试
1）需要宏定义 SPI_FLASH
2）使用USB_TEST 板测试
3）需要宏定义SPI引脚
--------------------------------FLASH部分术语解析-----------------------------
Sector：比BLOCK更小的单位
Block：	大部分的FLASH都以64K为单位空间ERASE
Chip：	整片FLASH
Page：
例：(256-byte per page)(4K-byte per sector/16page per sector)(64K-byte per block/16-sector per block)(8-block per chip)
*******************************************************************************/

#include "USART_ISP.H"

#include "STM32_USART.H"
#include "STM32_TOOLS.H"
#include "STM32_GPIO.H"

//#define USB_TEST_BD				//USB_TEST板
//#define SPI_FLASH_OSTL
//#define CMSIS_CDC_BD			//CMSIS-CDC板

#include "string.h"
//#include "stdlib.h"
//#include "stdio.h"

#include "stm32f10x_type.h"
//#include "stm32f10x_spi.h"
#include "stm32f10x_gpio.h"
#include "stm32f10x_rcc.h"
#include "stm32f10x_dma.h"
//#include "stm32f10x_nvic.h"

//#include "STM32_WOW.H"
//#include "STM32_PWM.H"
//#include "STM32_SYS.H"
//#include "STM32_SPI.H"
//#include "STM32_GPIO.H"
//#include "STM32_SYSTICK.H"
//#include "STM32_USART.H"

//#define	 Usart_ISP_Simulation 		//模拟从机
/*******************************************************************************
* 函数名			:	function
* 功能描述		:	函数功能说明 
* 输入			: void
* 返回值			: void
*******************************************************************************/
void Usart_ISP_Cof(ISP_Conf_TypeDef *ISP_Conf)
{
	USART_DMA_ConfigurationEV	(ISP_Conf->USARTx,115200,(u32*)ISP_Conf->ISP_DATA.ISP_RxBuffer,ISP_BufferSize);	//USART_DMA配置--查询方式，不开中断
	GPIO_Configuration_OPP50	(ISP_Conf->RESET_CTL_PORT,ISP_Conf->RESET_CTL_Pin);			//将GPIO相应管脚配置为PP(推挽)输出模式，最大速度50MHz----V20170605
	GPIO_Configuration_OPP50	(ISP_Conf->BOOT0_CTL_PORT,ISP_Conf->BOOT0_CTL_Pin);			//将GPIO相应管脚配置为PP(推挽)输出模式，最大速度50MHz----V20170605
	Usart_ISP_Reset(ISP_Conf);																																								//重置编程器---恢复所有参数为默认值
//	ISP_Conf->ISP_FUN=ISP_SLAVE;			//测试---将模块设置为从机
}
/*******************************************************************************
* 函数名			:	Usart_ISP_CommandSend
* 功能描述		:	串口编程发送命令程序
* 输入			: void
* 返回值			: void
*******************************************************************************/
void Usart_ISP_Process(ISP_Conf_TypeDef *ISP_Conf)
{
	if(ISP_Conf->ISP_FUN==ISP_SLAVE)				//模块作为从机----更新程序
	{
		Usart_ISP_SlaveProcess(ISP_Conf);			//模块作为从机时的处理程序
	}
	else if(ISP_Conf->ISP_FUN==ISP_MASTER)	//模块作为主机----烧录目标板
	{
		Usart_ISP_MasterProcess(ISP_Conf);			//模块作为主机时的处理程序
	}
	else if(ISP_Conf->ISP_FUN==ISP_WaitDeliver)			//等待释放从机)
	{
		Usart_ISP_CheckFun(ISP_Conf);					//检测ISP模块工作模式---空闲时检测
	}
	else
	{
		Usart_ISP_CheckFun(ISP_Conf);					//检测ISP模块工作模式---空闲时检测
	}	
//	Usart_ISP_MasterProcess(ISP_Conf);			//模块作为主机时的处理程序
//	Usart_ISP_SlaveProcess(ISP_Conf);			//模块作为从机时的处理程序
}
/*******************************************************************************
* 函数名			:	Usart_ISP_SlaveProcess
* 功能描述		:	模块作为从机时的处理程序
* 输入			: void
* 返回值			: void
*******************************************************************************/
void Usart_ISP_SlaveProcess(ISP_Conf_TypeDef *ISP_Conf)		//模块作为从机时的处理程序
{
	ISP_Conf->ISP_DATA.ReceivedLen=USART_ReadBufferIDLE(ISP_Conf->USARTx,(u32*)ISP_Conf->ISP_DATA.ISP_RvBuffer,(u32*)ISP_Conf->ISP_DATA.ISP_RxBuffer);	//串口空闲模式读串口接收缓冲区，如果有数据，将数据拷贝到RevBuffer,并返回接收到的数据个数，然后重新将接收缓冲区地址指向RxdBuffer
	if(ISP_Conf->ISP_DATA.ReceivedLen)
	{
		ISP_Conf->OverRunTime=0;									//超时时间
		if(ISP_Conf->ISP_DATA.ReceivedLen==1)			//单字节----识别波特率
		{
			if(ISP_Conf->ISP_DATA.ISP_RvBuffer[0]==0x7F)	//自举应答
			{
				if(ISP_Conf->Connected==ISP_STATUS_UnConnect)
				{
					Usart_ISP_Reset(ISP_Conf);														//重置编程器---恢复所有参数为默认值
					ISP_Conf->Connected=ISP_STATUS_WaitConnect;						//ISP等待连接（作为从机)
				}
				else if(ISP_Conf->Connected==ISP_STATUS_Connectting||ISP_Conf->Connected==ISP_STATUS_WaitConnect)
				{
				}
				else if(ISP_Conf->Connected==ISP_STATUS_Connectted)
				{					
					Usart_ISP_SetSlaveStatus(ISP_Conf,ISP_STATUS_WaitCommand);		//ISP等待命令（作为从机)
					Usart_ISP_ACK(ISP_Conf);
				}																							//ISP应答
			}
		}
		else if(ISP_Conf->ISP_DATA.ReceivedLen==2&&ISP_Conf->ISP_SLAVE_STATUS==ISP_STATUS_WaitCommand)				//2字节---接收命令过程
		{
			Usart_ISP_CommandRead(ISP_Conf);			//串口接收命令（主机->从机)
		}
		else if((ISP_Conf->ISP_DATA.ReceivedLen==5&&(ISP_Conf->ISP_SLAVE_STATUS==ISP_STATUS_WaitReadAddr||ISP_Conf->ISP_SLAVE_STATUS==ISP_STATUS_WaitWAddr||ISP_Conf->ISP_SLAVE_STATUS==ISP_STATUS_WaitGoAddr))||ISP_Conf->ISP_SLAVE_STATUS==ISP_STATUS_WaitEraseAddr)				//5个字节---地址类数据接收地址过程
		{
			Usart_ISP_GetAddr(ISP_Conf);						//ISP获取写数据起始地址(主机->从机)
		}
		else if(ISP_Conf->ISP_DATA.ReceivedLen==2&&ISP_Conf->ISP_SLAVE_STATUS==ISP_STATUS_WaitLengh)				//2字节---接收待处理数据长度，读数据时，传入地址后再传入待读取的数据长度
		{
			Usart_ISP_GetLengh(ISP_Conf);					//ISP获取需要读取的数据长度(主机->从机)，读数据时，传入地址后再传入待读取的数据长度
		}
		else if(ISP_Conf->ISP_SLAVE_STATUS==ISP_STATUS_WaitWData)	//ISP等待接收待写入数据,写数据时，传完地址后等待传入数据，再执行写操作
		{
			Usart_ISP_WriteMemory(ISP_Conf);			//ISP写数据（主机->从机）写数据时，传完地址后等待传入数据，再执行写操作
		}
				
	}
	else if(ISP_Conf->ISP_SLAVE_STATUS==ISP_STATUS_WaitReadData)	//等待数据读取完成
	{
		Usart_ISP_ReadMemory(ISP_Conf);															//ISP读数据（从机->主机）
	}	
	else if(ISP_Conf->ISP_SLAVE_STATUS==ISP_STATUS_WaitSData)			//ISP等待发送数据
	{
		Usart_ISP_SendBuffer(ISP_Conf);															//ISP上传数据（从机->主机)
	}
	else if(ISP_Conf->ISP_SLAVE_STATUS==ISP_STATUS_WaitErase||ISP_Conf->ISP_SLAVE_STATUS==ISP_STATUS_WaitErased)		//ISPISP等待擦除
	{
		Usart_ISP_Erase(ISP_Conf);						//ISP擦除操作，接收到擦除命令后，应答，等待输入待擦除地址（全部擦除或者页擦除）等待擦除完成，完成后应答
	}
	else if(ISP_Conf->ISP_SLAVE_STATUS==ISP_STATUS_WaitWrited)	//ISP等待接收待写入数据,写数据时，传完地址后等待传入数据，再执行写操作
	{
		Usart_ISP_WriteMemory(ISP_Conf);			//ISP写数据（主机->从机）写数据时，传完地址后等待传入数据，再执行写操作
	}
	else if(ISP_Conf->ISP_SLAVE_STATUS==ISP_STATUS_WaitReset)	//程序下载完后从机需要重置
	{
		Usart_ISP_CheckFun(ISP_Conf);					//检测ISP模块工作模式---空闲时检测
	}
	else	if((ISP_Conf->ISP_SLAVE_STATUS!=ISP_STATUS_IDLE)||(ISP_Conf->ISP_FUN==ISP_SLAVE))				//非初始状态时超时复位
	{
		ISP_Conf->OverRunTime=ISP_Conf->OverRunTime+1;					//超时时间
		if(ISP_Conf->OverRunTime>=5000000)				//约5秒
		Usart_ISP_Reset(ISP_Conf);								//重置编程器---恢复所有参数为默认值
	}
//	ISP_Conf->ISP_DATA.NumHaveRead=0;	//接收的数据个数
}
/*******************************************************************************
* 函数名			:	Usart_ISP_MasterProcess
* 功能描述		:	模块作为主机时的处理程序
* 输入			: void
* 返回值			: void
*******************************************************************************/
void Usart_ISP_MasterProcess(ISP_Conf_TypeDef *ISP_Conf)		//模块作为主机时的处理程序
{
	Usart_MISP_StatusProcess(ISP_Conf);			//启动从机设备使从机运行
	Usart_ISP_Send(ISP_Conf);						//发送函数包括从机发送应答、发送地址、发送命令、发送数据
}
/*******************************************************************************
* 函数名			:	Usart_ISP_CheckFun
* 功能描述		:	检测ISP模块工作模式---空闲时检测
* 输入			: void
* 返回值			: void
*******************************************************************************/
void Usart_ISP_CheckFun(ISP_Conf_TypeDef *ISP_Conf)				//检测ISP模块工作模式---空闲时检测
{
	u32 delaytime=0x00;
//	GPIO_Configuration_OPP50	(ISP_Conf->RESET_CTL_PORT,ISP_Conf->RESET_CTL_Pin);			//将GPIO相应管脚配置为PP(推挽)输出模式，最大速度50MHz----V20170605
//	GPIO_Configuration_OPP50	(ISP_Conf->BOOT0_CTL_PORT,ISP_Conf->BOOT0_CTL_Pin);			//将GPIO相应管脚配置为PP(推挽)输出模式，最大速度50MHz----V20170605
//	GPIO_Configuration_INA		(ISP_Conf->RESET_CTL_PORT,ISP_Conf->RESET_CTL_Pin);			//将GPIO相应管脚配置为PP(推挽)输出模式，最大速度50MHz----V20170605
//	GPIO_Configuration_INA		(ISP_Conf->BOOT0_CTL_PORT,ISP_Conf->BOOT0_CTL_Pin);			//将GPIO相应管脚配置为PP(推挽)输出模式，最大速度50MHz----V20170605
//	GPIO_ReadInputDataBit(ISP_Conf->RESET_CTL_PORT,ISP_Conf->RESET_CTL_Pin);
//	GPIO_ReadInputDataBit(ISP_Conf->BOOT0_CTL_PORT,ISP_Conf->BOOT0_CTL_Pin);
//	GPIO_Configuration_IPD(ISP_Conf->RESET_CTL_PORT,ISP_Conf->RESET_CTL_Pin);			//将GPIO相应管脚配置为下拉输入模式----V20170605
//	GPIO_Configuration_IPD(ISP_Conf->BOOT0_CTL_PORT,ISP_Conf->BOOT0_CTL_Pin);			//将GPIO相应管脚配置为下拉输入模式----V20170605
//	GPIO_Configuration_IPU(ISP_Conf->RESET_CTL_PORT,ISP_Conf->RESET_CTL_Pin);			//将GPIO相应管脚配置为上拉输入模式----V20170605
//	GPIO_Configuration_IPU(ISP_Conf->BOOT0_CTL_PORT,ISP_Conf->BOOT0_CTL_Pin);			//将GPIO相应管脚配置为上拉输入模式----V20170605
	//判断主机还是从机
	//---------------------判断是否为从机：编程器将RESET脚拉低，将BOOT0脚拉高
//	GPIO_Configuration_IPU(ISP_Conf->RESET_CTL_PORT,ISP_Conf->RESET_CTL_Pin);			//将GPIO相应管脚配置为上拉输入模式----V20170605
	
	
	if(ISP_Conf->ISP_SLAVE_STATUS==ISP_STATUS_WaitReset)	//作为从机时程序下载完后从机需要重置
	{
		GPIO_Configuration_IPD(ISP_Conf->BOOT0_CTL_PORT,ISP_Conf->BOOT0_CTL_Pin);				//将GPIO相应管脚配置为下拉输入模式----V20170605
		while((GPIO_ReadInputDataBit(ISP_Conf->BOOT0_CTL_PORT,ISP_Conf->BOOT0_CTL_Pin)==Bit_SET));
		Usart_ISP_Reset(ISP_Conf);						//重置编程器---恢复所有参数为默认值
	}
	else if(ISP_Conf->ISP_MASTER_STATUS==ISP_MSTATUS_WaitDeliver)	//作为主机时烧录完成后等待从机离开
	{
		GPIO_Configuration_IPD(ISP_Conf->RESET_CTL_PORT,ISP_Conf->RESET_CTL_Pin);			//将GPIO相应管脚配置为下拉输入模式----V20170605
		if(GPIO_ReadInputDataBit(ISP_Conf->RESET_CTL_PORT,ISP_Conf->RESET_CTL_Pin)==Bit_SET)
		{
//			Usart_ISP_Reset(ISP_Conf);						//重置编程器---恢复所有参数为默认值
			ISP_Conf->TimeCount=0;
		}
		else
		{
			if(ISP_Conf->TimeCount++>20000)
				Usart_ISP_Reset(ISP_Conf);						//重置编程器---恢复所有参数为默认值
		}
	}
	else
	{	
		GPIO_Configuration_IPD(ISP_Conf->BOOT0_CTL_PORT,ISP_Conf->BOOT0_CTL_Pin);				//将GPIO相应管脚配置为下拉输入模式----V20170605		
		while(delaytime++<0xFFFF)
		{
			if((GPIO_ReadInputDataBit(ISP_Conf->BOOT0_CTL_PORT,ISP_Conf->BOOT0_CTL_Pin)==Bit_SET))
			{
				ISP_Conf->ISP_FUN=ISP_SLAVE;		//ISP作为从机
				return;
			}
		}
		//---------------------判断是否为主机(不为从机时则认为是从机）：从机正常工作时，RESET脚带上拉，BOOT0脚为低
		{
			Usart_ISP_Reset(ISP_Conf);			//重置编程器---恢复所有参数为默认值
			ISP_Conf->ISP_FUN=ISP_MASTER;		//ISP作为主机--更新自身程序
			ISP_Conf->ISP_MASTER_STATUS	=ISP_MSTATUS_IDLE;
			GPIO_Configuration_OPP50	(ISP_Conf->RESET_CTL_PORT,ISP_Conf->RESET_CTL_Pin);			//将GPIO相应管脚配置为PP(推挽)输出模式，最大速度50MHz----V20170605
			GPIO_Configuration_OPP50	(ISP_Conf->BOOT0_CTL_PORT,ISP_Conf->BOOT0_CTL_Pin);			//将GPIO相应管脚配置为PP(推挽)输出模式，最大速度50MHz----V20170605		
		}
	}		
}
/*******************************************************************************
* 函数名			:	Usart_ISP_ACK
* 功能描述		:	ISP应答
* 输入			: void
* 返回值			: void
*******************************************************************************/
void Usart_ISP_ACK(ISP_Conf_TypeDef *ISP_Conf)	//ISP应答
{
	ISP_Conf->ISP_DATA.Command[0]=ISP_ANSWER_ACK;
	USART_DMASend(ISP_Conf->USARTx,(u32*)ISP_Conf->ISP_DATA.Command,1);	//串口DMA发送程序
}
/*******************************************************************************
* 函数名			:	Usart_ISP_NACK
* 功能描述		:	ISP不应答
* 输入			: void
* 返回值			: void
*******************************************************************************/
void Usart_ISP_NACK(ISP_Conf_TypeDef *ISP_Conf)		//ISP不应答
{
	ISP_Conf->ISP_DATA.Command[0]=ISP_ANSWER_NACK;
	USART_DMASend(ISP_Conf->USARTx,(u32*)ISP_Conf->ISP_DATA.Command,1);	//串口DMA发送程序
}

