wegam/STM32F10xUSBF/FWLIB/Lib/Protocol/USART_ISP - 副本.C
/*******************************************************************************
* 函数名			:	Usart_ISP_CommandSend
* 功能描述		:	串口编程发送命令程序；读数据分五步：1-读数据命令，2-读数据起始地址，3-需要读取的长度，4-读数据过程，5-上报数据
* 输入			: void
* 返回值			: void
*******************************************************************************/
void Usart_ISP_ReadMemory(ISP_Conf_TypeDef *ISP_Conf)		//ISP读数据（从机->主机）
{	
	#ifdef	Usart_ISP_Simulation 		//模拟从机
	{
		//*******************执行读数据操作
//		ISP_Conf->ISP_DATA.ISP_TxBuffer[0]=0x79;
//		memcpy(&ISP_Conf->ISP_DATA.ISP_TxBuffer[1], ISP_Conf->ISP_DATA.ISP_TvBuffer, ISP_Conf->ISP_DATA.SendLen+1);	//复制数据
		Usart_ISP_SetSlaveStatus(ISP_Conf,ISP_STATUS_WaitSData);		//ISP等待发送数据			
	}
	#else
	{
		//*******************执行读数据操作
		//----此为等待外部Flash读取数据完成，当数据读取完成后，由外部程序设置ISP_STATUS_WaitSData状态
		//1）外部检测到ISP_STATUS_WaitReadData状态后
		//2）根据地址ReadAddr和待发送长度SendLen读取相应数据
		//3）读取完成后，将数据复制到ISP_Conf->ISP_DATA.ISP_TvBuffer发送备份区
		//4）设置ISP_STATUS_WaitSData状态，表示数据准备完成，等待发送
	}
	#endif
}
/*******************************************************************************
* 函数名			:	Usart_ISP_CommandSend
* 功能描述		:	串口编程发送命令程序
* 输入			: void
* 返回值			: void
*******************************************************************************/
void Usart_ISP_WriteMemory(ISP_Conf_TypeDef *ISP_Conf)	//ISP写数据（主机->从机）写数据时，传完地址后等待传入数据，再执行写操作
{	
	#ifdef	Usart_ISP_Simulation 		//模拟从机
	{
		if(ISP_Conf->ISP_SLAVE_STATUS==ISP_STATUS_WaitWData)		//ISP等待接收待写入数据
		{
			unsigned char	Wlen=ISP_Conf->ISP_DATA.ISP_RvBuffer[0];						//要写入Flash的数据长度（字节数)
			unsigned char Bcc=BCC8(ISP_Conf->ISP_DATA.ISP_RvBuffer,Wlen+2);		//异或校验;					
			if(Bcc!=ISP_Conf->ISP_DATA.ISP_RvBuffer[Wlen+2])
			{
				return;
			}
			ISP_Conf->ISP_DATA.WriteLen=ISP_Conf->ISP_DATA.ISP_RvBuffer[0];		//要写入Flash的数据长度（字节数)	
			memcpy(ISP_Conf->ISP_DATA.ISP_TvBuffer, &ISP_Conf->ISP_DATA.ISP_RvBuffer[1], ISP_Conf->ISP_DATA.WriteLen+1);	//复制数据
			Usart_ISP_SetSlaveStatus(ISP_Conf,ISP_STATUS_WaitWrited);				//ISP等待写入完成
		}
		else if(ISP_Conf->ISP_SLAVE_STATUS==ISP_STATUS_WaitWrited)	//ISP等待写入完成
		{
			Usart_ISP_ACK(ISP_Conf);	//ISP应答
			Usart_ISP_SetSlaveStatus(ISP_Conf,ISP_STATUS_WaitCommand);				//ISP等待命令（作为从机)
		}
	}
	#else
	{
		if(ISP_Conf->ISP_SLAVE_STATUS==ISP_STATUS_WaitWData)		//ISP等待接收待写入数据
		{
			unsigned char	Wlen=ISP_Conf->ISP_DATA.ISP_RvBuffer[0];						//要写入Flash的数据长度（字节数)
			unsigned char Bcc=BCC8(ISP_Conf->ISP_DATA.ISP_RvBuffer,Wlen+2);		//异或校验;					
			if(Bcc!=ISP_Conf->ISP_DATA.ISP_RvBuffer[Wlen+2])
			{
				return;
			}
			ISP_Conf->ISP_DATA.WriteLen=ISP_Conf->ISP_DATA.ISP_RvBuffer[0];		//要写入Flash的数据长度（字节数)	
			//当外部检测到ISP_STATUS_WaitWrite状态时，根据ISP_Conf->ISP_DATA.WriteLen长度往Flash写入数据，写入完成到设置ISP_STATUS_WaitWrited状态
			memcpy(ISP_Conf->ISP_DATA.ISP_RvBuffer, &ISP_Conf->ISP_DATA.ISP_RvBuffer[1], ISP_Conf->ISP_DATA.WriteLen+1);	//复制数据
			Usart_ISP_SetSlaveStatus(ISP_Conf,ISP_STATUS_WaitWrite);				//ISP等待写数据
		}
		else if(ISP_Conf->ISP_SLAVE_STATUS==ISP_STATUS_WaitWrited)	//ISP等待写入完成
		{
			//当外部检测到ISP_STATUS_WaitWrite状态时，根据ISP_Conf->ISP_DATA.WriteLen长度往Flash写入数据，写入完成到设置ISP_STATUS_WaitWrited状态
			Usart_ISP_ACK(ISP_Conf);	//ISP应答
			Usart_ISP_SetSlaveStatus(ISP_Conf,ISP_STATUS_WaitCommand);				//ISP等待命令（作为从机)
		}
	}
	#endif
//	unsigned short Wlen=ISP_Conf->ISP_RvBuffer[0];	//获取要写入的数据长度（字节数)
//	unsigned char Bcc=BCC8(ISP_Conf->ISP_RvBuffer,Wlen+2);		//异或校验;
//	if(Bcc!=ISP_Conf->ISP_RvBuffer[Wlen+2])
//	{
//		return;
//	}
//	ISP_Conf->ISP_STATUS=ISP_STATUS_WRITE;		//FLASH执行写操作
//	memcpy(ISP_Conf->ISP_TvBuffer, &ISP_Conf->ISP_RvBuffer[1], Wlen+1);
//	Usart_ISP_ACK(ISP_Conf);						//ISP应答
}
/*******************************************************************************
* 函数名			:	Usart_ISP_CommandSend
* 功能描述		:	串口编程发送命令程序
* 输入			: void
* 返回值			: void
*******************************************************************************/
void Usart_ISP_SendBuffer(ISP_Conf_TypeDef *ISP_Conf)	//ISP上传数据（从机->主机)
{	

	ISP_Conf->ISP_DATA.ISP_TxBuffer[0]=0x79;
	memcpy(&ISP_Conf->ISP_DATA.ISP_TxBuffer[1], ISP_Conf->ISP_DATA.ISP_TvBuffer, ISP_Conf->ISP_DATA.USARTSendLen+1);	//复制数据
	USART_DMASend(ISP_Conf->USARTx,(u32*)ISP_Conf->ISP_DATA.ISP_TxBuffer,ISP_Conf->ISP_DATA.USARTSendLen+2);				//串口DMA发送程序
	Usart_ISP_SetSlaveStatus(ISP_Conf,ISP_STATUS_WaitCommand);				//已经完成数据发送命令，状态更新为等待下一个命令ISP_STATUS_WaitCommand

	
//	unsigned short Wlen=ISP_Conf->ISP_RvBuffer[0];	//获取要写入的数据长度（字节数)
//	unsigned char Bcc=BCC8(ISP_Conf->ISP_RvBuffer,Wlen+2);		//异或校验;
//	if(Bcc!=ISP_Conf->ISP_RvBuffer[Wlen+2])
//	{
//		return;
//	}
//	ISP_Conf->ISP_STATUS=ISP_STATUS_WRITE;		//FLASH执行写操作
//	memcpy(ISP_Conf->ISP_TvBuffer, &ISP_Conf->ISP_RvBuffer[1], Wlen+1);
//	Usart_ISP_ACK(ISP_Conf);						//ISP应答
}
/*******************************************************************************
* 函数名			:	Usart_ISP_CheckFun
* 功能描述		:	检测ISP模块工作模式---空闲时检测
* 输入			: void
* 返回值			: void
*******************************************************************************/
void Usart_ISP_Erase(ISP_Conf_TypeDef *ISP_Conf)				//ISP擦除操作，接收到擦除命令后，应答，等待输入待擦除地址（全部擦除或者页擦除）等待擦除完成，完成后应答
{
	//ISP_Conf->ISP_SLAVE_STATUS==ISP_STATUS_WaitErase||ISP_Conf->ISP_SLAVE_STATUS==ISP_STATUS_WaitErased
	#ifdef	Usart_ISP_Simulation 		//模拟从机
	{
		if(ISP_Conf->ISP_SLAVE_STATUS==ISP_STATUS_WaitErase)	//开始擦除
		{
			if(ISP_Conf->ISP_DATA.WriteAddr==0xFF)	//全部擦除
			{
				Usart_ISP_ACK(ISP_Conf);													//ISP应答---擦除完成
				Usart_ISP_Reset(ISP_Conf);												//重置编程器---恢复所有参数为默认值---模式切换后复位
				Usart_ISP_SetSlaveStatus(ISP_Conf,ISP_STATUS_WaitErased);	//状态为擦除完成
			}
		}
		else if(ISP_Conf->ISP_SLAVE_STATUS==ISP_STATUS_WaitErased)	//等待擦除完成
		{
			Usart_ISP_SetSlaveStatus(ISP_Conf,ISP_STATUS_WaitCommand);	//状态为擦除完成，ISP等待命令（作为从机)
		}
	}
	#else
	{
		if(ISP_Conf->ISP_SLAVE_STATUS==ISP_STATUS_WaitErase)	//开始擦除
		{
			if(ISP_Conf->ISP_DATA.WriteAddr==0xFF)	//全部擦除
			{
				Usart_ISP_SetSlaveStatus(ISP_Conf,ISP_STATUS_Eraseing);			//设置从机状态--ISP正在擦除
			}
		}
		else if(ISP_Conf->ISP_SLAVE_STATUS==ISP_STATUS_WaitErased)			//等待擦除完成
		{
			Usart_ISP_ACK(ISP_Conf);							//ISP应答---擦除完成
			Usart_ISP_SetSlaveStatus(ISP_Conf,ISP_STATUS_WaitCommand);	//状态为擦除完成，ISP等待命令（作为从机)
		}
		
