wegam/STM32F10xUSBF/FWLIB/Lib/Protocol/USART_ISP - 副本.C
	}	
	#endif
}
/*******************************************************************************
* 函数名			:	Usart_ISP_Reset
* 功能描述		:	重置编程器---恢复所有参数为默认值
* 输入			: void
* 返回值			: void
*******************************************************************************/
u8 Usart_ISP_GetSlaveStatus(ISP_Conf_TypeDef *ISP_Conf)	//返回从机状态值
{	
	return(ISP_Conf->ISP_SLAVE_STATUS);		//返回从机状态值
}
/*******************************************************************************
* 函数名			:	Usart_ISP_Reset
* 功能描述		:	重置编程器---恢复所有参数为默认值
* 输入			: void
* 返回值			: void
*******************************************************************************/
void Usart_ISP_SetSlaveStatus(ISP_Conf_TypeDef *ISP_Conf,ISP_SLAVE_STATUS_TypeDef Status)	//设置从机状态
{	
	ISP_Conf->ISP_SLAVE_STATUS=Status;	//设置状态值
}












//------------------------------------主机专有函数
/*******************************************************************************
*函数名			:	Usart_MISP_StatusProcess
*功能描述		:	函数功能说明
*输入				: 
*返回值			:	无
*******************************************************************************/
void Usart_MISP_StatusProcess(ISP_Conf_TypeDef *ISP_Conf)			//启动从机设备使从机运行
{
	if(ISP_Conf->OverRunTime++>2000000)			//10S超时---应答0.5S超时
	{
		Usart_ISP_Reset(ISP_Conf);						//重置编程器---恢复所有参数为默认值
	}
	if(ISP_Conf->ISP_MASTER_STATUS==ISP_MSTATUS_IDLE)								//工作在主机模式下的空闲---准备开始检查有无从机连接
	{
		ISP_Conf->ISP_MASTER_STATUS=ISP_MSTATUS_ResetDevice;
		Usart_MISP_RunDevice(ISP_Conf);						//启动从机设备使从机正常运行
		ISP_Conf->OverRunTime=0;									//超时时间
		Usart_MISP_GetFirmwareInf(ISP_Conf);			//从Flash中获取固件信息
	}
	else if(ISP_Conf->ISP_MASTER_STATUS==ISP_MSTATUS_ResetDevice)		//执行上电复位
	{
		if(ISP_Conf->TimeCount++<10000)					//计时时间--100mS
		{			
			Usart_MISP_ResetDevice(ISP_Conf);			//复位从机设备--使从机进行ISP模式			
		}
		else
		{
			ISP_Conf->TimeCount=0;																			//计时时间--清零
			ISP_Conf->ISP_MASTER_STATUS=ISP_MSTATUS_WriteConnect;				//ISP主机准备连接----复位后检测从机
			Usart_MISP_SetDevice(ISP_Conf);															//启动从机接收BOOT0使从机进行下载状态
		}
	}
	else if(ISP_Conf->ISP_MASTER_STATUS==ISP_MSTATUS_WriteConnect)	//ISP主机准备连接----复位后检测从机
	{
		ISP_Conf->MasterLastStatus=ISP_MSTATUS_WriteConnect;					//存储主机上一个状态，根据上一个状态等到从机应答时进行下一步操作:等待应答
		ISP_Conf->ISP_MASTER_STATUS=ISP_MSTATUS_WaitAck;							//ISP主机等待从机应答
		Usart_MISP_Connect(ISP_Conf);																	//主机连接从机函数
	}
	else if(ISP_Conf->ISP_MASTER_STATUS==ISP_MSTATUS_Connectted)		//ISP主机与从机已经连接完成---准备写入数据/检查有没有读写保护，有则需要解除保护，没有就开始写数据
	{
		ISP_Conf->MasterLastStatus=ISP_MSTATUS_WriteGet;							//存储主机上一个状态，根据上一个状态等到从机应答时进行下一步操作:禁止所有Flash扇区的写保护
		ISP_Conf->ISP_MASTER_STATUS=ISP_MSTATUS_WaitAck;							//ISP主机等待从机应答
		Usart_MISP_GetDevice(ISP_Conf);																//Write Unprotect命令用于禁止所有Flash扇区的写保护。
	}
	else if(ISP_Conf->ISP_MASTER_STATUS==ISP_MSTATUS_WriteUnprotect)		//ISP主机与从机已经连接完成---准备写入数据/检查有没有读写保护，有则需要解除保护，没有就开始写数据
	{
		ISP_Conf->MasterLastStatus=ISP_MSTATUS_WriteUnprotect;				//存储主机上一个状态，根据上一个状态等到从机应答时进行下一步操作:禁止所有Flash扇区的写保护
		ISP_Conf->ISP_MASTER_STATUS=ISP_MSTATUS_WaitAck;							//ISP主机等待从机应答
		Usart_MISP_WriteUnprotect(ISP_Conf);													//Write Unprotect命令用于禁止所有Flash扇区的写保护。
	}
	else if(ISP_Conf->ISP_MASTER_STATUS==ISP_MSTATUS_WaitUnprotect)		//ISP主机与从机已经连接完成---准备写入数据/检查有没有读写保护，有则需要解除保护，没有就开始写数据
	{
		ISP_Conf->MasterLastStatus=ISP_MSTATUS_WaitUnprotect;				//存储主机上一个状态，根据上一个状态等到从机应答时进行下一步操作:禁止所有Flash扇区的写保护
		ISP_Conf->ISP_MASTER_STATUS=ISP_MSTATUS_WaitAck;							//ISP主机等待从机应答
	}
	else if(ISP_Conf->ISP_MASTER_STATUS==ISP_MSTATUS_FlashUnprotected)		//已禁止所有Flash扇区的写保护，可以进行写操作
	{
		ISP_Conf->MasterLastStatus	=ISP_MSTATUS_WriteEraseCMD;							//存储主机上一个状态，根据上一个状态等到从机应答时进行下一步操作:擦除
		ISP_Conf->ISP_MASTER_STATUS	=ISP_MSTATUS_WaitAck;										//ISP主机等待从机应答
		Usart_MISP_CommandSend(ISP_Conf,ISP_COMMAND_Erase);									//串口编程发送命令程序---擦除
	}
	else if(ISP_Conf->ISP_MASTER_STATUS==ISP_MSTATUS_WriteEraseConf)						//发送擦除参数
	{
		ISP_Conf->MasterLastStatus	=ISP_MSTATUS_WriteEraseConf;								//存储主机上一个状态，根据上一个状态等到从机应答时进行下一步操作:从应用程序指定的地址开始将最多 256 个字节的数据写入 RAM 或 Flash---需要应答
		ISP_Conf->ISP_MASTER_STATUS	=ISP_MSTATUS_WaitAck;												//ISP主机等待从机应答
		Usart_MISP_CommandSend(ISP_Conf,0xFF);																	//全部擦除
	}	
	else if(ISP_Conf->ISP_MASTER_STATUS==ISP_MSTATUS_EraseDone)						//已经完成擦除
	{
		ISP_Conf->MasterLastStatus	=ISP_MSTATUS_GetFirmwareInf;								//存储主机上一个状态，根据上一个状态等到从机应答时进行下一步操作:从应用程序指定的地址开始将最多 256 个字节的数据写入 RAM 或 Flash---需要应答
		ISP_Conf->ISP_MASTER_STATUS	=ISP_MSTATUS_GetFirmwareInf;							//ISP主机等待从机应答
	}	
	else if(ISP_Conf->ISP_MASTER_STATUS==ISP_MSTATUS_GetedFirmwareInf)
	{
		ISP_Conf->MasterLastStatus	=ISP_MSTATUS_WriteWM;	//ISP_MSTATUS_WriteData
		ISP_Conf->ISP_MASTER_STATUS	=ISP_MSTATUS_WriteWM;
		ISP_Conf->ISP_MDATA.WriteAddr=ISP_Conf->ISP_MDATA.GoAddr;							//起始地址
//		Usart_MISP_CommandSend(ISP_Conf,ISP_COMMAND_WM);										//写MM命令
	}
	else if(ISP_Conf->ISP_MASTER_STATUS==ISP_MSTATUS_ReadFirmware)
	{
		ISP_Conf->MasterLastStatus	=ISP_MSTATUS_ReadFirmware;
		ISP_Conf->ISP_MASTER_STATUS	=ISP_MSTATUS_ReadFirmware;
	}
	else if(ISP_Conf->ISP_MASTER_STATUS==ISP_MSTATUS_WaitFirmware)
	{
		if(ISP_Conf->OverRunTime++>400000)				//复位后2秒内没连接上从机重新复位模块
		{
			Usart_ISP_Reset(ISP_Conf);							//重置编程器---恢复所有参数为默认值
		}
	}
	else if(ISP_Conf->ISP_MASTER_STATUS==ISP_MSTATUS_GettedFirmware)	//获取到固件
	{
		ISP_Conf->ISP_MASTER_STATUS=ISP_MSTATUS_WriteData;
//		ISP_Conf->ISP_MASTER_STATUS	=ISP_MSTATUS_WaitAck;
		ISP_Conf->ISP_MDATA.WriteAddr+=0xFF;
	}
	else if(ISP_Conf->ISP_MASTER_STATUS==ISP_MSTATUS_WriteWM)
	{
		ISP_Conf->MasterLastStatus	=ISP_MSTATUS_WriteWM;
		ISP_Conf->ISP_MASTER_STATUS	=ISP_MSTATUS_WaitAck;
		Usart_MISP_CommandSend(ISP_Conf,ISP_COMMAND_WM);										//写MM命令
	}
	else if(ISP_Conf->ISP_MASTER_STATUS==ISP_MSTATUS_WriteAddr)						//写地址
	{
		ISP_Conf->MasterLastStatus	=ISP_MSTATUS_WriteAddr;
		ISP_Conf->ISP_MASTER_STATUS	=ISP_MSTATUS_WaitAck;
		ISP_Conf->ISP_DATA.ISP_TvBuffer[0]=ISP_Conf->ISP_MDATA.WriteAddr>>24;
		ISP_Conf->ISP_DATA.ISP_TvBuffer[1]=ISP_Conf->ISP_MDATA.WriteAddr>>16;
		ISP_Conf->ISP_DATA.ISP_TvBuffer[2]=ISP_Conf->ISP_MDATA.WriteAddr>>8;
		ISP_Conf->ISP_DATA.ISP_TvBuffer[3]=ISP_Conf->ISP_MDATA.WriteAddr>>0;
		ISP_Conf->ISP_DATA.ISP_TvBuffer[4]=BCC8(ISP_Conf->ISP_DATA.ISP_TvBuffer,4);		//异或校验
//		ISP_Conf->ISP_MDATA.WriteAddr+=ISP_BufferSize;
		ISP_Conf->ISP_DATA.USARTSendLen=5;
//		Usart_MISP_CommandSend(ISP_Conf,ISP_COMMAND_WM);										//写MM命令
	}
	else if(ISP_Conf->ISP_MASTER_STATUS==ISP_MSTATUS_WriteData)						//写地址
	{
		ISP_Conf->MasterLastStatus	=ISP_MSTATUS_WriteData;
		ISP_Conf->ISP_MASTER_STATUS	=ISP_MSTATUS_WaitAck;
		ISP_Conf->ISP_DATA.USARTSendLen=ISP_Conf->ISP_MDATA.WriteLen;
//		ISP_Conf->ISP_MDATA.SumHaveWritten+=ISP_Conf->ISP_MDATA.WriteLen-2;
//		Usart_MISP_CommandSend(ISP_Conf,ISP_COMMAND_WM);										//写MM命令
	}
	else if(ISP_Conf->ISP_MASTER_STATUS==ISP_MSTATUS_WriteGo)						//写地址
	{
		ISP_Conf->MasterLastStatus	=ISP_MSTATUS_WriteGo;
		ISP_Conf->ISP_MASTER_STATUS	=ISP_MSTATUS_WaitAck;
		Usart_MISP_CommandSend(ISP_Conf,ISP_COMMAND_Go);										//写MM命令
	}
	else if(ISP_Conf->ISP_MASTER_STATUS==ISP_MSTATUS_WriteGoAddr)						//写地址
	{
		ISP_Conf->MasterLastStatus	=ISP_MSTATUS_WriteGoAddr;
		ISP_Conf->ISP_MASTER_STATUS	=ISP_MSTATUS_WaitAck;
		
		ISP_Conf->ISP_DATA.ISP_TvBuffer[0]=ISP_Conf->ISP_MDATA.StartAddr>>24;
		ISP_Conf->ISP_DATA.ISP_TvBuffer[1]=ISP_Conf->ISP_MDATA.StartAddr>>16;
		ISP_Conf->ISP_DATA.ISP_TvBuffer[2]=ISP_Conf->ISP_MDATA.StartAddr>>8;
		ISP_Conf->ISP_DATA.ISP_TvBuffer[3]=ISP_Conf->ISP_MDATA.StartAddr>>0;
		ISP_Conf->ISP_DATA.ISP_TvBuffer[4]=BCC8(ISP_Conf->ISP_DATA.ISP_TvBuffer,4);		//异或校验
		ISP_Conf->ISP_DATA.USARTSendLen=5;
		
//		Usart_MISP_CommandSend(ISP_Conf,ISP_COMMAND_Go);										//写MM命令
	}
	else if(ISP_Conf->ISP_MASTER_STATUS==ISP_MSTATUS_ResetDevice2)						//写地址
	{
		u32 timedelay=0;
		Usart_MISP_ResetDevice(ISP_Conf);				//复位从机
		while(timedelay++<0xFFF);
		Usart_MISP_RunDevice(ISP_Conf);					//启动从机设备使从机正常运行
		while(timedelay++<0xFFF);
		ISP_Conf->ISP_MASTER_STATUS=ISP_MSTATUS_WaitDeliver;		//等待释放从机
		ISP_Conf->ISP_FUN=ISP_WaitDeliver;			//等待释放从机
//		GPIO_Configuration_IPD(ISP_Conf->RESET_CTL_PORT,ISP_Conf->RESET_CTL_Pin);			//将GPIO相应管脚配置为下拉输入模式----V20170605
//		while(1);
		
