wegam/STM32F10xUSBF/FWLIB/Lib/Protocol/USART_ISP - 副本.C
	}
	
	else if(ISP_Conf->ISP_MASTER_STATUS==ISP_MSTATUS_GetFirmwareInf||ISP_Conf->ISP_MASTER_STATUS==ISP_MSTATUS_WaitFirmwareInf)
	{
		if(ISP_Conf->OverRunTime++>400000)				//复位后2秒内没连接上从机重新复位模块
		{
			Usart_ISP_Reset(ISP_Conf);							//重置编程器---恢复所有参数为默认值
		}
	}
	else if(ISP_Conf->ISP_MASTER_STATUS==ISP_MSTATUS_WaitAck)				//ISP主机等待从机应答以及等待超时处理
	{
		bool Result=FALSE;				//定义布尔变量
		Result=Usart_MISP_ReadAck(ISP_Conf);					//主机读取从机应答:有应答返回TRUE，否则返回FALSE
		if(Result==TRUE)					//接收到应答
		{
			if(ISP_Conf->MasterLastStatus==ISP_MSTATUS_WriteConnect)			//存储主机上一个状态，根据上一个状态等到从机应答时进行下一步操作:等待应答
			{
				ISP_Conf->ISP_MASTER_STATUS=ISP_MSTATUS_Connectted;					//ISP主机与从机已经连接完成
			}
			else if(ISP_Conf->MasterLastStatus==ISP_MSTATUS_WriteGet)	//禁止所有Flash扇区的写保护
			{
				ISP_Conf->ISP_MASTER_STATUS=ISP_MSTATUS_WriteUnprotect;			//已禁止所有Flash扇区的写保护，可以进行写操作
			}
			else if(ISP_Conf->MasterLastStatus==ISP_MSTATUS_WriteUnprotect)	//禁止所有Flash扇区的写保护
			{
				ISP_Conf->ISP_MASTER_STATUS=ISP_MSTATUS_WaitUnprotect;			//已禁止所有Flash扇区的写保护，可以进行写操作
			}
			else if(ISP_Conf->MasterLastStatus==ISP_MSTATUS_WaitUnprotect)	//禁止所有Flash扇区的写保护
			{
				ISP_Conf->ISP_MASTER_STATUS=ISP_MSTATUS_FlashUnprotected;			//已禁止所有Flash扇区的写保护，可以进行写操作
			}
			else if(ISP_Conf->MasterLastStatus==ISP_MSTATUS_WriteEraseCMD)	//擦除应答
			{
				ISP_Conf->ISP_MASTER_STATUS=ISP_MSTATUS_WriteEraseConf;				//输入擦除参数
			}
			else if(ISP_Conf->MasterLastStatus==ISP_MSTATUS_WriteEraseConf)	//擦除参数
			{
				ISP_Conf->ISP_MASTER_STATUS=ISP_MSTATUS_EraseDone;						//擦除完成
			}
			else if(ISP_Conf->MasterLastStatus==ISP_MSTATUS_WriteWM)	//擦除参数
			{
				ISP_Conf->ISP_MASTER_STATUS=ISP_MSTATUS_WriteAddr;						//擦除完成
			}
			else if(ISP_Conf->MasterLastStatus==ISP_MSTATUS_WriteAddr)	//写地址
			{
				ISP_Conf->ISP_MASTER_STATUS=ISP_MSTATUS_ReadFirmware;						//擦除完成
			}
			else if(ISP_Conf->MasterLastStatus==ISP_MSTATUS_WriteData)	//擦除参数
			{
				ISP_Conf->ISP_MDATA.SumHaveWritten+=ISP_Conf->ISP_MDATA.WriteLen-2;
				if(ISP_Conf->ISP_MDATA.SumHaveWritten<ISP_Conf->ISP_MDATA.FirmwareLen)
				{
					ISP_Conf->ISP_MASTER_STATUS=ISP_MSTATUS_WriteWM;						//擦除完成	
					ISP_Conf->ISP_MDATA.WriteAddr+=1;					
				}
				else
				{
					ISP_Conf->ISP_MASTER_STATUS=ISP_MSTATUS_WriteGo;						//擦除完成
				}
			}
			else if(ISP_Conf->MasterLastStatus==ISP_MSTATUS_WriteGo)				//写运行地址
			{
				ISP_Conf->ISP_MASTER_STATUS	=ISP_MSTATUS_WriteGoAddr;
			}
			else if(ISP_Conf->MasterLastStatus==ISP_MSTATUS_WriteGoAddr)		//完成
			{
				ISP_Conf->ISP_MASTER_STATUS	=ISP_MSTATUS_ResetDevice2;
			}
		}
		else											//无应答
		{
			if(ISP_Conf->MasterLastStatus==ISP_MSTATUS_WriteConnect)			//存储主机上一个状态，根据上一个状态等到从机应答时进行下一步操作:等待应答
			{
				if(ISP_Conf->TimeCount++>1000)						//计时时间--100mS,超时无应答，重新发送连接命令
				{
					ISP_Conf->TimeCount=0;									//计时时间--清零
					ISP_Conf->ISP_MASTER_STATUS=ISP_MSTATUS_WriteConnect;		//ISP主机准备连接----复位后检测从机
				}
				if(ISP_Conf->OverRunTime++>100000)				//复位后0.5秒内没连接上从机重新复位模块
				{
					Usart_ISP_Reset(ISP_Conf);							//重置编程器---恢复所有参数为默认值
				}
			}
//			else if(ISP_Conf->MasterLastStatus==ISP_MSTATUS_WriteUnprotect)	//禁止所有Flash扇区的写保护
//			{
//				ISP_Conf->ISP_MASTER_STATUS=ISP_MSTATUS_WriteUnprotect;			//已禁止所有Flash扇区的写保护，可以进行写操作
//			}
		}
	}
	
}
u8 Usart_MISP_GetStatus(ISP_Conf_TypeDef *ISP_Conf)	//返回从机状态值
{	
	return(ISP_Conf->ISP_MASTER_STATUS);		//返回从机状态值
}
/*******************************************************************************
*函数名			:	Usart_MISP_GetFirmwareInf
*功能描述		:	从Flash中获取固件信息
*输入				: 
*返回值			:	无
*******************************************************************************/
void Usart_MISP_GetFirmwareInf(ISP_Conf_TypeDef *ISP_Conf)			//从Flash中获取固件信息
{
	
}
/*******************************************************************************
*函数名			:	Usart_ISP_GetDevice
*功能描述		:	启动从机设备使从机运行
*输入				: 
*返回值			:	无
*******************************************************************************/
void Usart_MISP_GetDevice(ISP_Conf_TypeDef *ISP_Conf)			//获取从机芯片信息
{
	Usart_MISP_CommandSend(ISP_Conf,ISP_COMMAND_Get);				//串口编程发送命令程序//Get:获取当前自举程序版本及允许使用的命令
}
/*******************************************************************************
*函数名			:	function
*功能描述		:	函数功能说明
*输入				: 
*返回值			:	无
*******************************************************************************/
void Usart_MISP_WriteUnprotect(ISP_Conf_TypeDef *ISP_Conf)			//Write Unprotect命令用于禁止所有Flash扇区的写保护。
{
	Usart_MISP_CommandSend(ISP_Conf,ISP_COMMAND_WU);	//串口编程发送命令程序
}
/*******************************************************************************
*函数名			:	Usart_ISP_Connect
*功能描述		:	主机连接从机函数
*输入				: 
*返回值			:	无
*******************************************************************************/
void Usart_MISP_Connect(ISP_Conf_TypeDef *ISP_Conf)					//主机连接从机函数
{
		ISP_Conf->ISP_DATA.USARTSendLen=1;										//发送一字节0x7F
		ISP_Conf->ISP_DATA.ISP_TvBuffer[0]=0x7F;							//连接符
}
/*******************************************************************************
*函数名			:	Usart_ISP_Send
*功能描述		:	复位从机设备--使从机进行ISP模式
*输入				: 
*返回值			:	无
*******************************************************************************/
void Usart_MISP_ResetDevice(ISP_Conf_TypeDef *ISP_Conf)			//复位从机设备--使从机进行ISP模式
{
	GPIO_SetBits(ISP_Conf->BOOT0_CTL_PORT,ISP_Conf->BOOT0_CTL_Pin);		//BOOT0拉高
	GPIO_ResetBits(ISP_Conf->RESET_CTL_PORT,ISP_Conf->RESET_CTL_Pin);	//RESET脚拉低
}
/*******************************************************************************
*函数名			:	Usart_ISP_SetDevice
*功能描述		:	启动从机接收BOOT0使从机进行下载状态
*输入				: 
*返回值			:	无
*******************************************************************************/
void Usart_MISP_SetDevice(ISP_Conf_TypeDef *ISP_Conf)			//启动从机接收BOOT0使从机进行下载状态
{
	GPIO_SetBits(ISP_Conf->BOOT0_CTL_PORT,ISP_Conf->BOOT0_CTL_Pin);			//BOOT0拉低
	GPIO_SetBits(ISP_Conf->RESET_CTL_PORT,ISP_Conf->RESET_CTL_Pin);			//RESET脚拉高
}
/*******************************************************************************
*函数名			:	Usart_MISP_RunDevice
*功能描述		:	启动从机设备使从机正常运行
*输入				: 
*返回值			:	无
*******************************************************************************/
void Usart_MISP_RunDevice(ISP_Conf_TypeDef *ISP_Conf)			//启动从机设备使从机正常运行
{
	GPIO_ResetBits(ISP_Conf->BOOT0_CTL_PORT,ISP_Conf->BOOT0_CTL_Pin);		//BOOT0拉低
	GPIO_SetBits(ISP_Conf->RESET_CTL_PORT,ISP_Conf->RESET_CTL_Pin);			//RESET脚拉高
}
/*******************************************************************************
* 函数名			:	Usart_MISP_CommandSend
* 功能描述		:	串口编程发送命令程序
* 输入			: void
* 返回值			: void
*******************************************************************************/
void Usart_MISP_CommandSend(ISP_Conf_TypeDef *ISP_Conf,unsigned char Command)	//串口编程发送命令程序
{
	ISP_Conf->ISP_DATA.Command[0]=Command;
	ISP_Conf->ISP_DATA.Command[1]=Command^0XFF;
	USART_DMASend(ISP_Conf->USARTx,(u32*)ISP_Conf->ISP_DATA.Command,2);	//串口DMA发送程序
}
/*******************************************************************************
*函数名			:	Usart_MISP_ReadAck
*功能描述		:	主机读取从机应答
*输入				: 
*返回值			:	TRUE：有应答；FALSE：无应答
*******************************************************************************/
bool Usart_MISP_ReadAck(ISP_Conf_TypeDef *ISP_Conf)			//主机读取从机应答:有应答返回TRUE，否则返回FALSE
{
	ISP_Conf->ISP_DATA.ReceivedLen=USART_ReadBufferIDLE(ISP_Conf->USARTx,(u32*)ISP_Conf->ISP_DATA.ISP_RvBuffer,(u32*)ISP_Conf->ISP_DATA.ISP_RxBuffer);	//串口空闲模式读串口接收缓冲区，如果有数据，将数据拷贝到RevBuffer,并返回接收到的
	if(ISP_Conf->ISP_DATA.ReceivedLen)
	{
		if(ISP_Conf->ISP_DATA.ISP_RvBuffer[0]==0x79)
		{
			return TRUE;
		}
		else
		{
			return FALSE;
		}
	}
	return FALSE;
}



//------------------------------------公共函数

