wegam/STM32F10xUSBF/FWLIB/Lib/Protocol/USART_ISP - 副本.C
/*******************************************************************************
*函数名			:	function
*功能描述		:	发送函数包括从机发送应答、发送地址、发送命令、发送数据
*输入				: 
*返回值			:	无
*******************************************************************************/
void Usart_ISP_Send(ISP_Conf_TypeDef *ISP_Conf)						//发送函数包括从机发送应答、发送地址、发送命令、发送数据
{
	if(ISP_Conf->ISP_DATA.USARTSendLen)
	{
		memcpy(ISP_Conf->ISP_DATA.ISP_TxBuffer, ISP_Conf->ISP_DATA.ISP_TvBuffer,ISP_Conf->ISP_DATA.USARTSendLen);		//复制数据
		memset(ISP_Conf->ISP_DATA.ISP_TvBuffer,0xFF, ISP_BufferSize);	//接收缓冲区
		USART_DMASend(ISP_Conf->USARTx,(u32*)ISP_Conf->ISP_DATA.ISP_TxBuffer,ISP_Conf->ISP_DATA.USARTSendLen);			//串口DMA发送程序
		ISP_Conf->ISP_DATA.USARTSendLen=0;
	}
}

/*******************************************************************************
* 函数名			:	Usart_ISP_Reset
* 功能描述		:	重置编程器---恢复所有参数为默认值
* 输入			: void
* 返回值			: void
*******************************************************************************/
void Usart_ISP_Reset(ISP_Conf_TypeDef *ISP_Conf)	//重置编程器---恢复所有参数为默认值
{	
	//----------从机
	ISP_Conf->ISP_DATA.OffsetAddr				=	0;			//写从机时的地址偏移
	ISP_Conf->ISP_DATA.StartAddr				=	0;			//起始地址
	ISP_Conf->ISP_DATA.GoAddr						=	0;			//复位运行起始地址
	
	ISP_Conf->ISP_DATA.ReceivedLen			=	0;			//串口接收的数据个数
	ISP_Conf->ISP_DATA.USARTSendLen			=	0;			//需要往串口发送的数据个数---//当检测到SendLen不为0时自动发送数据
	
	ISP_Conf->ISP_DATA.FLASHNumToSave		=	0;			//需要往FLASH里保存的数据个数---当此不为0时SPI-FLASH自动存储数据
	ISP_Conf->ISP_DATA.FLASHNumToRead		=	0;			//需要从FLASH里读取的数据个数---当此不为0时，SPI-FLASH自动通过WriteAddr地址从SPI-FLASH读取数据
	
	ISP_Conf->ISP_DATA.ReadAddr					=	0;			//读数据起始地址
	
	ISP_Conf->ISP_DATA.WriteAddr				=	0;			//写入数据起始地址
	ISP_Conf->ISP_DATA.WriteLen					=	0;			//需要写入的长度	

	ISP_Conf->ISP_DATA.SumHaveReceived	=	0;			//作为从机时总共接收到的数据个数
	ISP_Conf->ISP_DATA.SumHaveWritten		=	0;			//主机总共往从机写入的数据个数

	
	
	ISP_Conf->ISP_FUN										=	ISP_IDLE;						//ISP状态为空闲，根据RESET接口状态和BOOT0接口状态可以切换为MASTER或者SLAVE
	ISP_Conf->ISP_SLAVE_STATUS					=	ISP_STATUS_IDLE;		//FLASH空闲状态，可以读写
	ISP_Conf->SlaveLastStatus						=	ISP_STATUS_IDLE;		//存储从机上一个状态，根据上一个状态进行下一步操作
	
	//---------主机
	ISP_Conf->ISP_MDATA.OffsetAddr			=0;
	ISP_Conf->ISP_MDATA.StartAddr				=0;
	ISP_Conf->ISP_MDATA.GoAddr					=0;
	
	ISP_Conf->ISP_MDATA.ReceivedLen			=0;
	ISP_Conf->ISP_MDATA.USARTSendLen		=0;
	
	ISP_Conf->ISP_MDATA.FLASHNumToSave	=0;
	ISP_Conf->ISP_MDATA.FLASHNumToRead	=0;
	
	ISP_Conf->ISP_MDATA.ReadAddr				=0;
	
	ISP_Conf->ISP_MDATA.WriteAddr				=0;
	ISP_Conf->ISP_MDATA.WriteLen				=0;
	
	ISP_Conf->ISP_MDATA.SumHaveReceived	=0;
	ISP_Conf->ISP_MDATA.SumHaveWritten	=0;
	
	ISP_Conf->ISP_MASTER_STATUS					=	ISP_MSTATUS_IDLE;		//ISP主机空闲状态----开始写前或者写完成后状态
	ISP_Conf->MasterLastStatus					=	ISP_MSTATUS_IDLE;		//存储主机上一个状态，根据上一个状态等到从机应答时进行下一步操作	
	
	
	
	ISP_Conf->OverRunTime								=	0;									//超时时间	
	ISP_Conf->TimeCount									=	0;									//计时时间	
	ISP_Conf->Connected=ISP_STATUS_UnConnect;							//ISP未连接（作为从机)
	
	memset(ISP_Conf->ISP_DATA.ISP_RxBuffer,0xFF, ISP_BufferSize);	//接收缓冲区
	memset(ISP_Conf->ISP_DATA.ISP_RvBuffer,0xFF, ISP_BufferSize);	//接收缓冲区--备份区
	memset(ISP_Conf->ISP_DATA.ISP_TxBuffer,0xFF, ISP_BufferSize);	//发送缓冲区
	memset(ISP_Conf->ISP_DATA.ISP_TvBuffer,0xFF, ISP_BufferSize);	//发送缓冲区--备份区
}

//---------------------公共函数





//---------------------主机专用函数
/*******************************************************************************
*函数名			:	USM_BSP_PROCESS
*功能描述		:	函数功能说明
*输入				: 
*返回值			:	无
*******************************************************************************/
void USM_BSP_PROCESS(BSP_Conf_TypeDef *BSP_Conf)
{
	if(BSP_Conf->BSPM_Info.BSP_MASTER_STATUS==BSP_MSTATUS_IDLE)
	{
		BSP_Conf->BSPM_Info.BSP_MASTER_STATUS=BSP_MSTATUS_ResetDevice;
		USM_BSP_RESET(BSP_Conf);			//复位从机
	}
	else if(BSP_Conf->BSPM_Info.BSP_MASTER_STATUS==BSP_MSTATUS_ResetDevice)
	{
		USM_BSP_RESET(BSP_Conf);			//复位从机
	}
}
/*******************************************************************************
*函数名			:	USM_BSP_RESET
*功能描述		:	复位从机：
							A模式--进入BOOT：RST高，BOT低（设置约100ms）->RST低，BOT高->进入BOOT
							B模式--进入运行：RST高，BOT低（设置约50ms）->RST低，BOT低（设置约50ms）->RST高，BOT低->运行程序
*输入				: 
*返回值			:	无
*******************************************************************************/
void USM_BSP_RESET(BSP_Conf_TypeDef *BSP_Conf)		//复位从机
{	
	if((BSP_Conf->BSPM_Info.BSP_MASTER_STATUS==BSP_MSTATUS_ResetDevice)&&(BSP_Conf->BSP_DATA.TimeCount++<10000))
	{
		GPIO_SetBits	(BSP_Conf->BSP_Port.BOOT0_CTL_PORT,BSP_Conf->BSP_Port.BOOT0_CTL_Pin);		//BOOT0拉高
		GPIO_ResetBits(BSP_Conf->BSP_Port.RESET_CTL_PORT,BSP_Conf->BSP_Port.RESET_CTL_Pin);		//RESET脚拉低
	}
	else if((BSP_Conf->BSPM_Info.BSP_MASTER_STATUS==BSP_MSTATUS_ResetDevice)&&(BSP_Conf->BSP_DATA.TimeCount++>=10000))
	{
		BSP_Conf->BSP_DATA.TimeCount=0;
		BSP_Conf->BSPM_Info.BSP_MASTER_STATUS=BSP_MSTATUS_WriteConnect;		//复位完成准备连接---发连接命令0x7F;		
		
		GPIO_SetBits(BSP_Conf->BSP_Port.BOOT0_CTL_PORT,BSP_Conf->BSP_Port.BOOT0_CTL_Pin);			//BOOT0拉高
		GPIO_SetBits(BSP_Conf->BSP_Port.RESET_CTL_PORT,BSP_Conf->BSP_Port.RESET_CTL_Pin);			//RESET脚拉高
	}
	else if((BSP_Conf->BSPM_Info.BSP_MASTER_STATUS==BSP_MSTATUS_ResetDevice2)&&(BSP_Conf->BSP_DATA.TimeCount++<10000))
	{
		GPIO_ResetBits(BSP_Conf->BSP_Port.BOOT0_CTL_PORT,BSP_Conf->BSP_Port.BOOT0_CTL_Pin);		//BOOT0拉低
		GPIO_ResetBits(BSP_Conf->BSP_Port.RESET_CTL_PORT,BSP_Conf->BSP_Port.RESET_CTL_Pin);		//RESET脚拉低
	}
	else if((BSP_Conf->BSPM_Info.BSP_MASTER_STATUS==BSP_MSTATUS_ResetDevice2)&&(BSP_Conf->BSP_DATA.TimeCount++>=10000))
	{
		BSP_Conf->BSP_DATA.TimeCount=0;
		BSP_Conf->BSPM_Info.BSP_MASTER_STATUS=BSP_MSTATUS_WaitDeliver;												//等待释放从机
		
		GPIO_ResetBits(BSP_Conf->BSP_Port.BOOT0_CTL_PORT,BSP_Conf->BSP_Port.BOOT0_CTL_Pin);		//BOOT0拉低
		GPIO_SetBits	(BSP_Conf->BSP_Port.RESET_CTL_PORT,BSP_Conf->BSP_Port.RESET_CTL_Pin);		//RESET脚拉高
	}
}
/*******************************************************************************
*函数名			:	USM_BSP_ResetDevice
*功能描述		:	复位从机设备--使从机进行ISP模式
*输入				: 
*返回值			:	无
*******************************************************************************/
void USM_BSP_ResetDevice(BSP_Conf_TypeDef *BSP_Conf)			//复位从机设备--使从机进行ISP模式
{
	GPIO_SetBits	(BSP_Conf->BSP_Port.BOOT0_CTL_PORT,BSP_Conf->BSP_Port.BOOT0_CTL_Pin);		//BOOT0拉高
	GPIO_ResetBits(BSP_Conf->BSP_Port.RESET_CTL_PORT,BSP_Conf->BSP_Port.RESET_CTL_Pin);		//RESET脚拉低
}
/*******************************************************************************
*函数名			:	USM_BSP_SetDevice
*功能描述		:	启动从机接收BOOT0使从机进行下载状态
*输入				: 
*返回值			:	无
*******************************************************************************/
void USM_BSP_SetDevice(BSP_Conf_TypeDef *BSP_Conf)			//启动从机接收BOOT0使从机进行下载状态
{
	GPIO_SetBits(BSP_Conf->BSP_Port.BOOT0_CTL_PORT,BSP_Conf->BSP_Port.BOOT0_CTL_Pin);			//BOOT0拉高
	GPIO_SetBits(BSP_Conf->BSP_Port.RESET_CTL_PORT,BSP_Conf->BSP_Port.RESET_CTL_Pin);			//RESET脚拉高
}
/*******************************************************************************
*函数名			:	USM_BSP_RunDevice
*功能描述		:	启动从机设备使从机正常运行
*输入				: 
*返回值			:	无
*******************************************************************************/
void USM_BSP_RunDevice(BSP_Conf_TypeDef *BSP_Conf)			//启动从机设备使从机正常运行
{
	GPIO_ResetBits(BSP_Conf->BSP_Port.BOOT0_CTL_PORT,BSP_Conf->BSP_Port.BOOT0_CTL_Pin);		//BOOT0拉低
	GPIO_SetBits	(BSP_Conf->BSP_Port.RESET_CTL_PORT,BSP_Conf->BSP_Port.RESET_CTL_Pin);		//RESET脚拉高
}
/*******************************************************************************
*函数名			:	USM_BSP_Get
*功能描述		:	获取当前自举程序版本及允许使用的命令
*输入				: 
*返回值			:	无
*******************************************************************************/
void USM_BSP_Get(BSP_Conf_TypeDef *BSP_Conf)		//获取当前自举程序版本及允许使用的命令
{

