wegam/STM32F10xUSBF/FWLIB/Lib/Protocol/USART_ISP - 副本.C
}
/*******************************************************************************
*函数名			:	Get Version & Read Protection Status
*功能描述		:	获取自举程序版本及 Flash 的读保护状态
*输入				: 
*返回值			:	无
*******************************************************************************/
void USM_BSP_GetVR(BSP_Conf_TypeDef *BSP_Conf)		//获取自举程序版本及 Flash 的读保护状态
{

}
/*******************************************************************************
*函数名			:	USM_BSP_GetId
*功能描述		:	获取芯片 ID
*输入				: 
*返回值			:	无
*******************************************************************************/
void USM_BSP_GetId(BSP_Conf_TypeDef *BSP_Conf)			//获取芯片 ID
{

}
/*******************************************************************************
*函数名			:	USM_BSP_ReadMemory
*功能描述		:	从应用程序指定的地址开始读取最多 256 个字节的存储器空间
*输入				: 
*返回值			:	无
*******************************************************************************/
void USM_BSP_ReadMemory(BSP_Conf_TypeDef *BSP_Conf)		//从应用程序指定的地址开始读取最多 256 个字节的存储器空间
{

}
/*******************************************************************************
*函数名			:	USM_BSP_Go
*功能描述		:	跳转到内部 Flash 或 SRAM 内的应用程序代码
*输入				: 
*返回值			:	无
*******************************************************************************/
void USM_BSP_Go(BSP_Conf_TypeDef *BSP_Conf)		//跳转到内部 Flash 或 SRAM 内的应用程序代码
{

}
/*******************************************************************************
*函数名			:	USM_BSP_EraseMemory
*功能描述		:	从应用程序指定的地址开始将最多 256 个字节的数据写入 RAM 或 Flash
*输入				: 
*返回值			:	无
*******************************************************************************/
void USM_BSP_WriteMemory(BSP_Conf_TypeDef *BSP_Conf)		//从应用程序指定的地址开始将最多 256 个字节的数据写入 RAM 或 Flash
{

}
/*******************************************************************************
*函数名			:	USM_BSP_WriteAddr
*功能描述		:	写地址----包含地址自动增加及完成判断
*输入				: 
*返回值			:	无
*******************************************************************************/
void USM_BSP_WriteAddr(BSP_Conf_TypeDef *BSP_Conf)		//写地址----包含地址自动增加及完成判断
{

}
/*******************************************************************************
*函数名			:	USM_BSP_WriteAddr
*功能描述		:	写地址----包含地址自动增加及完成判断
*输入				: 
*返回值			:	无
*******************************************************************************/
void USM_BSP_WriteData(BSP_Conf_TypeDef *BSP_Conf)		//数据----数组打包(长度，BCC校验）
{

}
/*******************************************************************************
*函数名			:	USM_BSP_EraseMemory
*功能描述		:	擦除一个到全部 Flash 页面
*输入				: 
*返回值			:	无
*******************************************************************************/
void USM_BSP_EraseMemory(BSP_Conf_TypeDef *BSP_Conf)		//擦除一个到全部 Flash 页面
{

}
/*******************************************************************************
*函数名			:	USM_BSP_EEraseMemory
*功能描述		:	使用双字节寻址模式擦除一个到全部 Flash 页面（仅用于v3.0 usart 自举程序版本及以上版本）
*输入				: 
*返回值			:	无
*******************************************************************************/
void USM_BSP_EEraseMemory(BSP_Conf_TypeDef *BSP_Conf)		//使用双字节寻址模式擦除一个到全部 Flash 页面（仅用于v3.0 usart 自举程序版本及以上版本）
{

}
/*******************************************************************************
*函数名			:	USM_BSP_WriteProtect
*功能描述		:	使能某些扇区的写保护
*输入				: 
*返回值			:	无
*******************************************************************************/
void USM_BSP_WriteProtect(BSP_Conf_TypeDef *BSP_Conf)		//使能某些扇区的写保护
{

}
/*******************************************************************************
*函数名			:	USM_BSP_WriteUnProtect
*功能描述		:	禁止所有 Flash 扇区的写保护
*输入				: 
*返回值			:	无
*******************************************************************************/
void USM_BSP_WriteUnProtect(BSP_Conf_TypeDef *BSP_Conf)		//禁止所有 Flash 扇区的写保护
{

}
/*******************************************************************************
*函数名			:	USM_BSP_ReadProtect
*功能描述		:	使能读保护
*输入				: 
*返回值			:	无
*******************************************************************************/
void USM_BSP_ReadProtect(BSP_Conf_TypeDef *BSP_Conf)		//使能读保护
{

}
/*******************************************************************************
*函数名			:	USM_BSP_ReadUnProtect
*功能描述		:	禁止读保护
*输入				: 
*返回值			:	无
*******************************************************************************/
void USM_BSP_ReadUnProtect(BSP_Conf_TypeDef *BSP_Conf)		//禁止读保护
{

}
/*******************************************************************************
*函数名			:	USM_BSP_GetAck
*功能描述		:	获取从机应答
*输入				: 
*返回值			:	无
*******************************************************************************/
void USM_BSP_GetAck(BSP_Conf_TypeDef *BSP_Conf)		//获取从机应答
{

}
/*******************************************************************************
* 函数名			:	Usart_MISP_CommandSend
* 功能描述		:	串口编程发送命令程序
* 输入			: void
* 返回值			: void
*******************************************************************************/
void USM_BSP_SendCommand(BSP_Conf_TypeDef *BSP_Conf,unsigned char Command)	//串口编程发送命令程序
{
	BSP_Conf->BSP_DATA.Command[0]=Command;
	BSP_Conf->BSP_DATA.Command[1]=Command^0XFF;
	USART_DMASend(BSP_Conf->BSP_Port.USARTx,(u32*)BSP_Conf->BSP_DATA.Command,2);	//串口DMA发送程序
}
/*******************************************************************************
*函数名			:	function
*功能描述		:	发送函数包括从机发送应答、发送地址、发送命令、发送数据
*输入				: 
*返回值			:	无
*******************************************************************************/
void USM_BSP_SendBuffer(BSP_Conf_TypeDef *BSP_Conf)						//发送函数包括从机发送应答、发送地址、发送命令、发送数据
{
	if(BSP_Conf->BSP_DATA.USARTSendLen)
	{
		memcpy(BSP_Conf->BSP_DATA.BSP_TxBuffer, BSP_Conf->BSP_DATA.BSP_TvBuffer,BSP_Conf->BSP_DATA.USARTSendLen);		//复制数据
		memset(BSP_Conf->BSP_DATA.BSP_TvBuffer,0xFF, BSP_BufferSize);	//接收缓冲区
		USART_DMASend(BSP_Conf->BSP_Port.USARTx,(u32*)BSP_Conf->BSP_DATA.BSP_TxBuffer,BSP_Conf->BSP_DATA.USARTSendLen);			//串口DMA发送程序
		BSP_Conf->BSP_DATA.USARTSendLen=0;
	}
}





//---------------------从机专用函数
/*******************************************************************************
*函数名			:	USS_BSP_PROCESS
*功能描述		:	函数功能说明
*输入				: 
*返回值			:	无
*******************************************************************************/
void USS_BSP_PROCESS(BSP_Conf_TypeDef *BSP_Conf)
{

