wegam/STM32F10xUSBF/FWLIB/Lib/Protocol/USART_ISP - 副本.C
}
/*******************************************************************************
*函数名			:	function
*功能描述		:	函数功能说明
*输入				: 
*返回值			:	无
*******************************************************************************/
void USS_BSP_RESET(BSP_Conf_TypeDef *BSP_Conf)
{

}
/*******************************************************************************
*函数名			:	USS_BSP_Get
*功能描述		:	获取当前自举程序版本及允许使用的命令
*输入				: 
*返回值			:	无
*******************************************************************************/
void USS_BSP_Get(BSP_Conf_TypeDef *BSP_Conf)		//获取当前自举程序版本及允许使用的命令
{

}
/*******************************************************************************
*函数名			:	Get Version & Read Protection Status
*功能描述		:	获取自举程序版本及 Flash 的读保护状态
*输入				: 
*返回值			:	无
*******************************************************************************/
void USS_BSP_GetVR(BSP_Conf_TypeDef *BSP_Conf)		//获取自举程序版本及 Flash 的读保护状态
{

}
/*******************************************************************************
*函数名			:	USS_BSP_GetId
*功能描述		:	获取芯片 ID
*输入				: 
*返回值			:	无
*******************************************************************************/
void USS_BSP_GetId(BSP_Conf_TypeDef *BSP_Conf)			//获取芯片 ID
{

}
/*******************************************************************************
*函数名			:	USS_BSP_ReadMemory
*功能描述		:	从应用程序指定的地址开始读取最多 256 个字节的存储器空间
*输入				: 
*返回值			:	无
*******************************************************************************/
void USS_BSP_ReadMemory(BSP_Conf_TypeDef *BSP_Conf)		//从应用程序指定的地址开始读取最多 256 个字节的存储器空间
{

}
/*******************************************************************************
*函数名			:	USS_BSP_Go
*功能描述		:	跳转到内部 Flash 或 SRAM 内的应用程序代码
*输入				: 
*返回值			:	无
*******************************************************************************/
void USS_BSP_Go(BSP_Conf_TypeDef *BSP_Conf)		//跳转到内部 Flash 或 SRAM 内的应用程序代码
{

}
/*******************************************************************************
*函数名			:	USS_BSP_WriteMemory
*功能描述		:	从应用程序指定的地址开始将最多 256 个字节的数据写入 RAM 或 Flash
*输入				: 
*返回值			:	无
*******************************************************************************/
void USS_BSP_WriteMemory(BSP_Conf_TypeDef *BSP_Conf)		//从应用程序指定的地址开始将最多 256 个字节的数据写入 RAM 或 Flash
{

}
/*******************************************************************************
*函数名			:	USS_BSP_EraseMemory
*功能描述		:	擦除一个到全部 Flash 页面
*输入				: 
*返回值			:	无
*******************************************************************************/
void USS_BSP_EraseMemory(BSP_Conf_TypeDef *BSP_Conf)		//擦除一个到全部 Flash 页面
{

}
/*******************************************************************************
*函数名			:	USS_BSP_EEraseMemory
*功能描述		:	使用双字节寻址模式擦除一个到全部 Flash 页面（仅用于v3.0 usart 自举程序版本及以上版本）
*输入				: 
*返回值			:	无
*******************************************************************************/
void USS_BSP_EEraseMemory(BSP_Conf_TypeDef *BSP_Conf)		//使用双字节寻址模式擦除一个到全部 Flash 页面（仅用于v3.0 usart 自举程序版本及以上版本）
{

}
/*******************************************************************************
*函数名			:	USS_BSP_WriteProtect
*功能描述		:	使能某些扇区的写保护
*输入				: 
*返回值			:	无
*******************************************************************************/
void USS_BSP_WriteProtect(BSP_Conf_TypeDef *BSP_Conf)		//使能某些扇区的写保护
{

}
/*******************************************************************************
*函数名			:	USS_BSP_WriteUnProtect
*功能描述		:	禁止所有 Flash 扇区的写保护
*输入				: 
*返回值			:	无
*******************************************************************************/
void USS_BSP_WriteUnProtect(BSP_Conf_TypeDef *BSP_Conf)		//禁止所有 Flash 扇区的写保护
{

}
/*******************************************************************************
*函数名			:	USS_BSP_ReadProtect
*功能描述		:	使能读保护
*输入				: 
*返回值			:	无
*******************************************************************************/
void USS_BSP_ReadProtect(BSP_Conf_TypeDef *BSP_Conf)		//使能读保护
{

}
/*******************************************************************************
*函数名			:	USS_BSP_ReadUnProtect
*功能描述		:	禁止读保护
*输入				: 
*返回值			:	无
*******************************************************************************/
void USS_BSP_ReadUnProtect(BSP_Conf_TypeDef *BSP_Conf)		//禁止读保护
{

}
/*******************************************************************************
*函数名			:	USS_BSP_ACK
*功能描述		:	向主机发送应答(0x79)
*输入				: 
*返回值			:	无
*******************************************************************************/
void USS_BSP_ACK(BSP_Conf_TypeDef *BSP_Conf)		//向主机发送应答(0x79)
{

}
/*******************************************************************************
*函数名			:	USS_BSP_NACK
*功能描述		:	向主机发送非应答(0x1F)
*输入				: 
*返回值			:	无
*******************************************************************************/
void USS_BSP_NACK(BSP_Conf_TypeDef *BSP_Conf)		//向主机发送非应答(0x1F)
{

}


